// pages/laugh/laugh.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
       laugh:[{
         node:"1.猪能吃的，叫湿垃圾，猪不能吃的，叫干垃圾，猪吃了会死的，叫有害垃圾，可以卖出去换猪的，叫可回收垃圾。。。站在猪的角度思考，垃圾这么分就对啦！"

       },
         {
           node: "2.不要暗中奉献，不要默默牺牲，并且觉得别人会有天感动。这种行为跟盗刷别人信用卡，等别人醒悟过来发现自己突然多了一笔债是一个性质。让别人在不知情的情况下背负债务，这是诈骗。"

         },
         {
           node: "3.诸葛亮空城计退司马懿，众将纷纷前来道贺。姜维道：“丞相之机，神鬼莫测。不过末将尚有一事不明。”诸葛亮道：“讲。”“丞相何以知司马懿生平谨慎，必不弄险？”“因为他是金牛座。”"

         },
         {
           node: '4.甲：啃干净的猪大骨是干垃圾?!没啃干净的就是湿垃圾?乙：你应该把骨头分离出来，肉就是湿垃圾，骨头就是干垃圾。甲：那骨头为什么是湿的?排骨也有骨头啊!乙：你到位点啊，就是把骨肉拆开甲：啃不干净怎么办?乙：罚款!'
         }
       ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})