// pages/budayang/budayang.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
     information:[
       {
         imgs:'../../images/la3.jpg',
         name:'定义',
         node: "有害垃圾是指存有对人体健康有害的重金属、有毒的物质或者对环境造成现实危害或者潜在危害的废弃物。投放时请注意轻放易破损的请连带包装或包裹后轻放如易挥发，请密封后投放。"
       },
       {
         imgs: '../../images/la2.jpg',
         node: "可回收垃圾（Recyclable garbage）是一种可以再生循环的垃圾，是生活垃圾分类的主要工作和影响垃圾减量的重要因素。轻投轻放清洁干燥、避免污染，废纸尽量平整立体包装请清空内容物，清洁后压扁投放有尖锐边角的，应包裹后投放。"
       },
       {
         imgs: '../../images/la1.jpg',
         node: "厨余垃圾(厨余垃圾)含有极高的水分与有机物，很容易腐坏，产生恶臭。经过妥善处理和加工，可转化为新的资源，高有机物含量的特点使其经过严格处理后可作为肥料、饲料，也可产生沼气用作燃料或发电，油脂部分则可用于制备生物燃料。厨余垃圾应当提供给专业化处理单位进行处理，严禁将废弃食用油脂（包括地沟油）加工后作为食用油使用，严禁直接使用厨余垃圾饲养畜禽及鱼类，严禁用未经无害化处理的厨余垃圾生产肥料。"
       },
       {
         imgs: '../../images/la4.jpg',
         node: "其他垃圾，又称干垃圾，指除可回收物、有害垃圾、厨余垃圾以外的其它生活废弃物。这类垃圾不会腐烂，危害大多较小，但无再次利用价值，其他垃圾包括砖瓦陶瓷、渣土、卫生间废纸、瓷器碎片等难以回收的废弃物，采取卫生填埋可有效减少对地下水、地表水、土壤及空气的污染，在当今社会，还无有效化解其他垃圾的好方法，所以需尽量少产生。尽量沥干水分难以辨识类别的生活垃圾投入其他垃圾容器内。"
       }
     ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})