// pages/you/hui.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    fenlei: [
      {
        little: "（一）电器电子产品类",
        node: '废弃计算机、打印机、复印件、传真机、扫描仪、投影仪、电视机、空调机、电线、插座等。'
      },
      {
        little: '（二）废纸张',
        node: '1、平面纸张：书本、报纸、复印纸、宣传单、包装纸、信封、硬纸板等；2、纸盒（箱）：纸板箱、包装盒（如点心盒、纸巾盒）、牛奶（饮料）利乐包装等。'
      },
      {
        little: '（三）废塑料',
        node: '1、瓶类：PET塑料瓶（矿泉水瓶、饮料瓶）、硬质塑料瓶、塑料油桶、乳液罐等；2、其他容器类：塑料盒（如冰激凌盒）、塑料杯（如酸奶杯、果冻杯）、软桶、塑料衣架、塑料玩具等；3、包装类：塑料袋、保鲜袋（膜）、包装袋（如零食包装袋、快递包装袋）、塑料泡沫、气泡缓冲材料、水果网套、热饮（如咖啡杯）杯盖等；4、其他塑料制品：废弃塑料文具等。'
      },
      {
        little: '（四）玻璃类',
        node: '玻璃瓶、白炽灯泡、碎玻璃、其他玻璃制品。'
      },
      {
        little: '（五）金属类',
        node: '金属罐（如易拉罐）、金属盒、其他金属制品、金属文件柜。'
      },
      {
        little: '（六）办公用品类',
        node: '沙发、茶几、办公桌、文件柜、椅子等办公家具。'
      },
    ]
  },
  
  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})